[
  {
    "title": "Buffalo Stories Archives & Blog",
    "text": "By Steve Cichon\n\nsteve@buffalostories.com\n\n@stevebuffalo\n\nExcerpt from 100 Years of Buffalo Broadcasting\n\nFor many kids and teens of the Eisenhower era, the different kinds of sounds coming out of radios gave them something of their own to listen to while doing their homework or on a transistor radio snuck under a pillow after bedtime.\n\nThere are also those who listened to deejays like The Hound and Lucky Pierre and were inspired to spend the next 60 years entertaining the world.\n\nFor example, Buffalo radio legends Sandy Beach and Jefferson Kaye, both of whom grew up in Massachusetts, listened to the Hound over KB’s powerful signal as youngsters and cited him as an inspiration.\n\nBut right here in Buffalo, a handful of the boys who’d be the broadcast Pied Pipers of their generation got their radio start in an old brick building in South Buffalo’s Seneca-Babcock neighborhood.\n\nA group of friends from St. Monica’s grammar school on Orlando Street spent most of the rest of their free time at the Boys’ Club a couple blocks away on Babcock Street.\n\nThe club’s organized activities, mostly sports, weren’t exactly what these boys were after. “They weren’t much for boxing,” activities director Jimmy Coyle would say for years after, “they were more for talking.”\n\nPast members of the Babcock Boys’ Club, from the Courier-Express, 1964\n\nDanny Neaverth, Joe Pinto (who’d later become Joey Reynolds on the radio), Bill Masters (who spent 20 years on WEBR and WBEN), Danny McBride (whose local broadcasting career spanned 60 years) were all major players starting a closed-circuit radio station for the club.\n\nJoey Pinto, center, brought his home record player to the Boys’ Club when the one in the club broke. That’s Joe Marszalak and Richard Quinn with him in a photo that ran in the Buffalo Evening News in 1956.\n\nThe boys convinced Boys’ Club manager Gurney Jenkins to get rid of an old jukebox that played 78 rpm records for Monday night dances and replace it with a modern record player and a microphone. Once they got the green light, all the boys went to work.\n\nWBCB could only be heard inside the Babcock Boys’ Club, but offered Buffalo the first taste of what would fill the airwaves for decades to come.\n\nJoe Pinto sent letters to record promoters and radio stations asking for old, about to be discarded, or greatly discounted records. He walked all over the city to collect the 45s which offered a more modern beat for the Boys’ Club dances.\n\nNeaverth and McBride wired the whole building for sound, and now the set-up was more than just for dances in the gym. There was music, news, and even commercials on a regular schedule. They boys eventually started doing play-by-play of the sporting events at the club.\n\nAnd a decade before their KB Radio cross-talk between Neaverth’s afternoon show and Reynolds’ evening show became the talk of Buffalo, the same two kids became the talk of South Buffalo with their “pretend” radio station at the Boys’ Club.\n\nWhile Danny and Joey were at The Boys’ Club and Bishop Timon, Tom Shannon was at Bishop Ryan High, getting one of his first on air gigs leading the school in the rosary as Fr. Rufus looked on.\n\nBoys’ Club veteran Danny McBride serves Pepsi-Cola and hot dogs at a WEBR Record Hop.\n\nWEBR deejays Tap Taplin, Bob Wells, Bernie Sandler, and Jack Eno prepare to broadcast live for a full week from the newest Your Host restaurant in the Sheridan Drive Plaza, Sheridan at Niagara Falls Blvd. in 1953.\n\nThis page is an excerpt from 100 Years of Buffalo Broadcasting by Steve Cichon\n\nThe full text of the book is now online.\n\nThe original 436-page book is available along with Steve’s other books online at The Buffalo Stories Bookstore and from fine booksellers around Western New York.\n\n©2020, 2021 Buffalo Stories LLC, staffannouncer.com, and Steve Cichon",
    "url": "http://blog.buffalostories.com/tag/seneca-babcock/"
  },
  {
    "title": "Discovering Buffalo, One Street at a Time",
    "text": "Hayes is one of Buffalo’s street names that was used twice! Municipalities typically don’t like having duplicate street names as it leads to difficulty with mail delivery and providing emergency services. Often when street name changes happened throughout Buffalo’s history, it was during times when they were removing duplicate street names. This usually happened when the City boundary was expanded, when Post Offices were consolidated or discontinued, or when confusion occurred due to duplicate names. Hayes Place is a short street off of Seneca Street near the I-190. Place is typically used for streets that don’t have a throughway. In the case of Hayes Place, the road dead-ends at a factory along railroad tracks. Interestingly, the other streets in this area also end at the tracks but are named Street. Buffalo does not have strict naming conventions when it comes to Street versus Avenue versus Road, etc! Hayes Road is also the official name of the ring road that circles UB South Campus, the centerpiece of which is Hayes Hall. All three of these are named for Edmund Hayes.\n\nEdmund B Hayes was born in 1849 in Farmington, Maine. He attended public and preparatory schools in Maine and then Dartmouth College. His time at Dartmouth was not continuous. Instead, Mr. Hayes would take time off in-between semesters to earn tuition by working at farms or teaching. After completing two years at Dartmouth, he transferred to MIT, where he graduated in 1873 with a civil engineering degree.\n\nAfter graduation, he worked for the Passaic Bridge Company in New Jersey and for the engineering division of the Erie Railroad. He came to Buffalo in 1874 to join George S. Field at the Morrison Field Bridge Company. At this time, railroads were expanding across the country, so bridge building was a very profitable business. Mr. Hayes handled the engineering, and Mr. Field dealt with the contracting.\n\nIn 1883, Mr. Hayes proposed a cantilever design for the Michigan Railroad bridge across the Niagara River. The Michigan Central Railway was owned by Cornelius Vanderbuilt, who was looking for a crossing between Canada and the US. Mr. Hayes proposed the first steel span cantilever bridge across the Niagara River, known as the Niagara Cantilever Bridge. Previous bridges across the gorge had been a suspension bridge. This was was the largest steel span bridge in the world at the time. The train was in operation until 1925 when modern trains became heavier and a new bridge was needed.\n\nIn 1884, the company became the Union Bridge Company, of which Mr. Hayes was part owner. Mr. Hayes and Mr. Field oversaw an 8-acre manufacturing site at the foot of Hamburg Street that created 15,000 tons of material used to make bridges worldwide! The Union Bridge Company built the Poughkeepsie Bridge over the Hudson River in 1888. This bridge was in service until 1974 and is listed on the National Register of Historic Places and is designated as a National Historic Civil Engineering Landmark. The bridge reopened in 2009 as a pedestrian walkway as part of the Walkway Over the Hudson Park.\n\nEdmund Hayes married Mary H. Warren in 1878. Mary was a sister-in-law to Edmund’s partner and friend George Fields. In 1892, they moved into a Green & Wicks-designed home at 147 North Street. This house was two doors down from the Metcalfe House. They had no children, but the home was known for entertaining people from the worlds of art, literature, music, and science.\n\nMr. Hayes served for three years as Chief of the Engineering Division of New York State under Governor Cornell’s administration from 1880 to 1882 and Governor Grover Cleveland’s in 1883. He was given an honorary military title by his friend Governor Grover Cleveland, who made him an honorary General in the National Guard, and he became General Edmund Hayes. The title was only honorary. A story was passed along regarding a time that General and Mrs. Hayes were eating dinner when a down on his luck man rang the doorbell. The man told the staff “surely General Hayes would want to see a fellow soldier” and that they had served in the same regiment during the war. General Hayes had the man turned away as they new he was lying as “General” Hayes had never fired a gun.\n\nIn 1891, the Union Bridge Company was sold to the US Steel Company, which late became the American Bridge Company. General Hayes and his wife took a trip overseas to celebrate. They traveled to Europe, Egypt, and Palestine. General Hayes became a Capitalist and Philanthropist.\n\nIn 1897, General Hayes invested with John J. Albright to found the Buffalo Bolt Company in North Tonawanda. They also invested in the Ontario Power Company in Canada. General Hayes was an early automobile user in Buffalo. He funded Hares Motors to manufacture Locomobile, Simplex, and Mercer automobiles.\n\nGeneral Hayes served on the Board of the Buffalo Fine Arts Academy (now Albright Knox Art Gallery). In 1892, he gave $5,000 ($81,271 in 2021 dollars) to assist them in offering classes. From 1915 until his death, he would give to the organization to cancel out their annual debts.\n\nThe Hayes Family attended St. Paul’s Episcopal Church. General Hayes Hayes was the longest-serving vestryman with 34 years of service. In the Episcopal Church, a vestryman is a member of the Church’s leading body. In 1906, St. Paul’s Episcopal Church was in financial distress. He offered $50,000 ($1.5 Million in 2021 dollars) to the church if others in the congregation matched it. The congregation matched the funds, and the church remained in Shelton Square.\n\nIn 1913, Dartmouth awarded him an honorary Master of Science degree 40 years after attending the school. He returned the favor with a check for $10,000 ($280,755 in 2021 dollars).\n\nIn 1922, Mr. and Mrs. Hayes moved to 198 North Street. They sold the 147 North Street home to the University of Buffalo Alumni as their first clubhouse. The Alumni Club was established in 1921, a separate organization from the Alumni Association. The Alumni Club was established to create a “greater university” through loyalty of the alumni. The Hayes House was well suited for a clubhouse. The grounds were shaded by elm trees. The house contained reception rooms, reading rooms, a library, card rooms, billiard room and an assembly hall. More than 2,000 meals were served at the Alumni Club each month. The financial collapse of 1929 affected the Alumni Club and membership was considered a luxury by the members, a luxury they could no longer afford. The Alumni Club put a portion of the property on the market, but no potential buyers came forward. They were unsuccessful in obtaining a bank loan and defaulted on the mortgage. After 1931, the Alumni Club became a group devoted to raising money for scholarships as opposed to a social organization. The 147 North Street house was then a restaurant for many years, including Tuyn’s Restaurant and Martin’s before the building was demolished. Like its neighbor, the Metcalfe House, the site of the Hayes House is now the lawns and gardens of UB’s Jacobs Executive Development Center (formerly the Butler Mansion).\n\nEdmund Hayes died on October 19, 1923, after suffering a stroke. Mary died a year later, on November 18, 1924. They are buried in Forest Lawn. They left significant amounts of money to various organizations throughout Buffalo:\n\nTheir artwork was left to the Buffalo Fine Arts Academy, along with $75,000 ($1.2 Million in 2021) for future art purchases.\n\nSt. Paul’s church received another $50,000 ($812,713 in 2021) for an endowment known as the Edmund Hayes Fund.\n\nBuffalo General Hospital received $10,000 ($162,542 in 2021) for an endowment known as the Edmund Hayes Fund.\n\nChildren’s Hospital received $10,000 ($162,542 in 2021) for the Mary H. Hayes Fund\n\nHome for the Friendless, $5,000 ($81,271 in 2021) to be known as the Mary H. Hayes Fund\n\nYMCA, $10,000 ($162,542 in 2021) for the Edmund Hayes Funds\n\nFarmington, Main Old South Church, $10,000 ($162,542 in 2021) for the Edmund Hayes Fund\n\nFarmington Library, $20,000 ($325,085 in 2021) to purchase books and maintain the institution\n\nThe remainder of the estate was divided equally between the University of Buffalo and Dartmouth College. The University of Buffalo received $389,000 ($6.3 Million in 2021). General Hayes had served on the UB Council from 1920 to 1923 – during the years when the University was trying to establish a College of Arts and Sciences. The Erie County Almshouse property was purchased by the University in 1909. The Hayes Estate bequest allowed the University to transform the Almshouse building into classrooms and offices. To remember General Hayes, the University named the building Edmund B. Hayes Hall. Hayes Hall is a highly visible structure along UB’s Main Street frontage and is often used in images to represent the South Campus.\n\nHayes Hall was initially built as the Erie County Insane Asylum as part of the Erie County Almshouse and Poor Farm. The building is the only remaining County insane asylum building in Erie County. The first Erie County Almshouse and Asylum was built at Porter and York in 1829. In 1849, the institution moved to Buffalo Plains (University Heights). What we now know as Hayes Hall was built in 1874-79 and was designed by George Metzger. In 1893, the mentally ill became wards of the State. Patients were moved to the State Asylum on Forest Avenue (the Richardson Olmsted Complex today). What is now Hayes Hall and the other buildings were used as a county hospital. The last patients were moved to the Erie County Home and Infirmary in 1926.\n\nIn 1926, Hayes Hall was remodeled in the Georgian Revival Style by Cyrus K. Porter and Sons. This was when the distinctive clock tower was added to the building. The building’s first university use was as an administrative and academic building. Hayes Hall remodeled again in 1954 by James, Meadows & Howard to expand the building for classroom uses. The the late 1960s, Hayes Hall was the site of student and faculty protests related to the Vietnam War and the Civil Rights Movement. Since 1977, the building has been home to the School for Architecture and Planning. (Note from Angela: this is where I spent a lot of time while getting my Masters in Planning from 2007-2009). The building underwent significant renovations from 2010-2015 by Bergmann Associates to modernize the building for a modern architecture and planning school. The building is listed on the National Register of Historic Places.\n\nNext time you drive past Hayes Place or Want to learn about other streets? Check out the Street Index. Don’t forget to subscribe to the page to be notified when new posts are made. You can do so by entering your email address in the box on the upper right-hand side of the home page. You can also follow the blog on facebook. If you enjoy the blog, please be sure to share it with your friends.\n\nSources:\n\n“General Hayes Noted Bridge Builder Dead”. Buffalo Commercial. October 19, 1923, p1.\n\n“General Edmund Hayes.” Buffalo Times. October 19, 1923, p22.\n\n“Arts Academy Benefits By Hayes’ Will” Buffalo Commercial. November 7, 1923, p12.\n\nEdens, John. “90 Years Ago, A Club for UB Alumni”. UB Reporter. December 22, 2011.\n\n“Edmund B. Hayes Hall.” University at Buffalo University Archives.\n\n“Edmund B. Hayes Hall.” Historic American Buildings Survey. SHP No 10PRO7210. Accessed via https://cris.parks.ny.gov/\n\nRead Full Post »",
    "url": "https://buffalostreets.com/category/seneca-babcock/"
  },
  {
    "title": "Buffalo Fire Department memorial vandalized in Seneca Babcock neighborhood",
    "text": "A Buffalo Fire Department memorial, which serves as a reminder of the deadliest event in Buffalo Fire Department history, has been vandalized.\n\nCall Box 191, located on North Division Street at Grosvenor in Buffalo's Seneca Babcock neighborhood, pays tribute to five Buffalo firefighters who were killed in the explosion, which occurred just after Christmas in 1983. The blast also killed two civilians and damaged nearly 100 homes.\n\nThe top shield and Maltese Cross were removed from the memorial.\n\nFive firefighters from Buffalo FD Ladder Company 5 were killed in the blast — Michael Austin, Michael Catanzaro, Matthew Colpoys, James Lickfield and Anthony Waszkielewicz.",
    "url": "https://spectrumlocalnews.com/nc%20/charlotte/news/2025/07/02/buffalo-fire-department-memorial-vandalized-in-seneca-babcock-neighborhood"
  },
  {
    "title": "'We're in a better spot now': Seneca Babcock Center receives long-overdue reimbursement from City of Buffalo",
    "text": "BUFFALO, N.Y. (WKBW) — The Seneca Babcock Community Center is finally receiving $101,000 from the City of Buffalo — money the center had been covering for utility bills over the past five years.\n\nSeneca Babcock Community Association President Brian Pilarski said he is relieved that the city has made good on its promise.\n\n“And low and behold today, it's all in there, and we're made whole with the city and moving in the right direction. All the utilities are in their name. They're currently paying all the bills. We're not getting any shut off notices,\" Pilarski said.\n\nWKBW\n\nFor years, Pilarski said the center was forced to pay utility bills that the city was supposed to cover, diverting funds from programs serving children and seniors. Last summer, the city took over payments but was late in catching up on the outstanding balance.\n\nRELATED: Seneca-Babcock centers reopen after temporary closure due to utility bill dispute with city\n\n“It took away from actual direct services. In this case, we budgeted for the utilities, but it took away from consumable supplies for our seniors and our kids.”\n\nWKBW\n\nPilarski said the prior city administration eventually paid off late bills but still owed the center $100,000.\n\nWhen Acting Mayor Chris Scanlon took office, Pilarski said he reached out to assure the center the reimbursement would happen.\n\nWKBW\n\n\"It was important me to get that done, not just for him, but for the surrounding neighborhood in that community center. Last thing we never want to see as a community center close, but that's a lot of money for a community center. So thankfully, we're able to put it behind us, and we could move forward,\" Scanlon said.\n\nWKBW\n\n“We're in a better spot now. We're all happy as an organization. As a representative of the organization, I’m happy,\" Pilarski said.",
    "url": "https://www.wkbw.com/news/local-news/buffalo/were-in-a-better-spot-now-seneca-babcock-center-receives-long-overdue-reimbursement-from-city-of-buffalo"
  },
  {
    "title": "Seneca-Babcock",
    "text": "Work is set to begin on the new Seneca-Babcock Community Center on Harrison Street in Buffalo. A groundbreaking ceremony was held on the site of the…\n\nListen • 1:48",
    "url": "https://www.btpm.org/tags/seneca-babcock"
  },
  {
    "title": "Babcock",
    "text": "Babcock Neighborhood, Buffalo, NY\n\nAn excerpt from\n\n\"Houses of Worship: A Guide to the Religious Architecture of Buffalo, New York\" Master of Architecture Thesis. Pp. 173-174.\n\nFound at Buffalo Central Library NA5235 B8 N37 1995\n\nBy James Napora\n\n\n\nD uring the founding years of the city, the Seneca/Babcock area served as a hunting and fishing ground for the Native population in of the area. As much of the land to the south of the cityremained forested, they maintained a relatively peaceful relationship with the white man. As the population of the city increased, it encroached upon these unsettled lands to the south.\n\n\n\nThe year 1827 saw the end to indigenous occupation of the area when the Indians traded a small brick house and the land in the vicinity for a white pony. The original portion of that house stood adjacent to the building at 256 Babcock.\n\n\n\nAs the population of the city spread into the area in the late1870s and early 1880s, the area became known as Oakdale after the large number of Oak trees standing there.\n\n\n\nThe intersection of Babcock and Clinton developed approximately ten years later as a German community, with many.of the residents there working in the adjacent railroad yards.",
    "url": "https://buffaloah.com/h/eastside/babcock.html"
  },
  {
    "title": "The Clean Air Coalition of W.N.Y.",
    "text": "Seneca Babcock\n\nResidents living on Peabody Street in Buffalo’s Seneca Babcock neighborhood have organized for more than a decade to hold Battaglia Demolition, a waste transfer site that was illegally operating a concrete crusher, accountable. Battaglia’s operations shook the foundations of residents’ homes, polluted the air with diesel particulates, and blanketed the neighborhood in silica dust, a pollutant known to cause respiratory illnesses such as asthma, lung disease and lung cancer. Through tenacious organizing by the team, in 2016, NYS Assistant Attorney General Jane Cameron filed a lawsuit against the company.\n\nIn April 2018, after years of documenting violations, protesting, picketing, writing letters, making phone calls, knocking on doors, planning press conferences, and advocating to public officials about the pollution and nuisance of Battaglia Demolition, Seneca Babcock residents scored a major victory. Erie County Supreme Court Justice Deborah A. Chimes ordered an injunction on the Battaglia Demolition facility, forcing the facility to halt all operations until it acquires the legally required permits. Additionally, the court held owner Peter Battaglia personally liable for damages caused to the surrounding community. Fines may total in excess of $14 million.\n\nMoving forward, Clean Air and residents of Peabody Street are calling on NYS to hold Battaglia accountable to all harm done to the community through a court-actioned Environmental Benefit Project. This would improve, restore, protect, and/or reduce risks to public health and the environment beyond that achieved by the company’s full compliance with applicable laws and regulations.\n\nKeep up to date on our campaign in Seneca Babcock by visiting our blog or singing up for our newsletter.",
    "url": "https://www.cacwny.org/campaigns/senecababcock/"
  },
  {
    "title": "Seneca-Babcock community centers temporarily close after bill dispute with city",
    "text": "",
    "url": "https://www.youtube.com/watch?v=jbbTXcXS5Ks"
  },
  {
    "title": "Seneca Babcock Community Center Archives",
    "text": "A team of business and community leaders have joined forces with The Seneca Babcock Community Association to build a new…",
    "url": "https://www.buffalorising.com/tags/seneca-babcock-community-center/"
  },
  {
    "title": "Seneca-Babcock Community Association • Erie County Anti Stigma Coalition",
    "text": "The Seneca-Babcock Community Association, Inc. in Buffalo, NY is one of the premier human and social services agencies in the Western New York area, provide a healthy sense of community for all that we serve. Our programs and activities provide skills and training to families that support healthy homes and healthy futures. Alongside community residents, elected and appointed officials, advisory groups and program partners provide a holistic approach to human services. Whether the need is child care, youth programs or senior citizen activities, the organization’s programs and activities focus in six areas of development: (1) sports and recreation, (2) education development, (3) arts and media, (4) health and wellness, (5) workforce development and (6) character and leadership development. The Seneca-Babcock Community Association, Inc. is committed to developing and enhancing the quality of life for residents of the Lovejoy district, including at-risk youth, adults, families and seniors. Our goal is to deliver a strong sense of empowerment through participation in education, economic, social and health related programs. Values Focus: working with historically underserved, promising youth, adults and senior citizens. Integrity: keeping our promise to youth, young adults, senior citizens and the community. Collaboration: working together to solve problems in our community. Accountability: being responsive to youth, young adults, senior citizens, their families and the community. Leadership Development: being community driven and developing future leaders. Relevance: being culturally relevant and using best practices to serve the community. Sustainability: strong leadership, capable staff, quality programs and abundant resources",
    "url": "https://letstalkstigma.org/members/seneca-babcock-community-association/"
  },
  {
    "title": "The CEO of the Seneca-Babcock...",
    "text": "",
    "url": "https://www.facebook.com/story.php?story_fbid=1099168232219963&id=100063803902212"
  },
  {
    "title": "Schools, Demographics, Things to Do - Homes.com",
    "text": "Source: Public Records\n\nHomes for Sale $154,900 4 Beds 1 Bath 1,171 Sq Ft 160 Selkirk St Welcome home to this well maintained, and partially updated home on a rare double lot with a great location just minutes from Downtown Buffalo. As you enter the home through the front from your beautiful wooden porch you'll enter a wide open living, and dining room with new carpets. Off both the living, and dining room you'll find 2 good sized bedrooms also with brand new carpets. The kitchen Matthew Golden Century 21 North East\n\n$219,900 6 Beds 2 Baths 2,600 Sq Ft 9 Milton St Welcome to 9 Milton Street. Nestled in a family-friendly neighborhood. This is a completely overhauled 2 family house with 2 separate front entrances and also a back entrance for both units. A newmetal roof with a 40 Years warranty, ensures peace of mind for homeowners. The home has been recently revitalized with new paint, new flooring, Partial new Electric work to enhance its appeal andcomfort. Mohammed Uddin WNY Metro Roberts Realty\n\n$135,000 3 Beds 1 Bath 1,082 Sq Ft 60 Manitoba St BACK ON THE MARKET!!! Discover the charm of this cozy 3-bedroom, 1-bath Bungalow in the heart of downtown Buffalo, NY. Ideal for both investors and owner-occupiers, this home offers a great rental history. Featuring an eat-in kitchen, a spacious living/dining room combo, and a partial basement for laundry, hot water tank and furnace, the property provides ample storage with a full attic. The Genique Meredith Infinitely Real Estate LLC\n\nSee All Homes\n\nInterested in learning more about homes in this area? Reach out to Rebecca Simpson, an experienced agent in this neighborhood.\n\nAverage Home Value Source: Public Records\n\nProperty Mix - Square Feet\n\nThis Neighborhood Has More Renters\n\nDemographics Total Population 2,250 Median Age 37 Population Density 5 ppl/acre Population under 18 27.4% On par with the national average 23.8% Population over 65 16.1% On par with the national average 19.1%\n\nFinances Median Household Income $28,963 Significantly below the national average $71,702 Average Household Income $34,877\n\nEducation and Workforce High School Graduates 78.5% College Graduates 9.7% Below the national average 34.1% Advanced Degrees 2.5% % Population in Labor Force 44.6% Below the national average 65.1%\n\nWeather Annual Precipitation 40'' Average Winter Low Temperature 19°F Average Summer High Temperature 80°F Annual Snowfall 188''\n\nArea Factors Bikeable Bike Score® 51 / 100 Car-Dependent Walk Score® 33 / 100 Some Transit Transit Score® 40 / 100 Source: Walk Score Source: Walk Score Sound Score® measures the noise level of any address. Transit Score® measures access to public transit. Bike Score® measures the bikeability of any address. Learn How Walk Score Works\n\nNearby Neighborhoods\n\nValley One of the oldest neighborhoods in Buffalo, and once a booming industrial district Abbott McKinley Cozy neighborhood close to downtown with walkable streets and well-equipped parks Broadway-Fillmore Lower eastside Buffalo urban neighborhood with diversity and renewal efforts Cazenovia Park Residential neighborhood near landmarks and local outlets First Ward One of Buffalo's oldest neighborhoods nestled against the Buffalo River Kaisertown Small neighborhood on the outskirts of Buffalo Search Nearby Neighborhoods\n\nReviews Are you familiar with the Seneca Babcock neighborhood? Leave a review to let others know what life in this neighborhood is like.\n\nWas this page helpful?",
    "url": "https://www.homes.com/local-guide/buffalo-ny/seneca-babcock-neighborhood/"
  },
  {
    "title": "Demolition of Seneca-Babcock \"eyesore\" begins",
    "text": "The two-week teardown process started Monday.\n\nBUFFALO, N.Y. — What neighbors have called a “health risk,” an “annoyance” and an “eyesore” in Buffalo’s Seneca-Babcock neighborhood has started being demolished.\n\nCity of Buffalo Department of Permit and Inspections Commissioner Cathy Amdur made the announcement Monday after she said the owner of the Battaglia Demolition building first abandoned the structure in 2018 and then left it unattended after a major fire last year.\n\nThe steel structure of the building was torn down and several truckloads of material were removed from the site according to neighbors on Peabody Street Monday night.\n\nBack in April, two common council members acted and urged a judge to do something about the building, and then in June, a judge ruled in favor of demolition and the city proceeded to bid the project out.\n\nAmdur said the entire demolition process should take around two weeks and will include the removal of 40 truckloads of debris from the site located at 1037 Seneca Street. The building can be seen on your right-hand side while driving North on the 190 toward the city.\n\n“Battaglia Demolition has stalled at every opportunity from cleaning up this site and our building inspectors have worked and worked through the court system to get to where we are today where this will be cleaned up and taken down to restore some calm and peace to this neighborhood,” said Amdur.\n\nThe building was used as part of a concrete crushing operation which the owner Peter Battaglia Jr. is also being sued over. Amdur explained how the City of Buffalo has fronted the $143,000 required to pay for the demolition and plans to bill Battaglia for the cost.\n\n2 On Your Side attempted to reach Peter Battaglia Jr. and his attorney Mark Sanchez but did not hear back by the time this story was posted.\n\nAmdur added that the city's legal department is prepared to get that money back if Battaglia does not pay and reassured neighbors about various safety measures that will be taken over the two-week process.\n\n“With a combination of following every regulation that is necessary for a situation like this, we are wetting it down, there is air monitoring and with our inspector here every day we will make sure the neighbors on Peabody Street are comfortable with what's going on,” Amdur said.",
    "url": "https://www.wgrz.com/article/news/local/demolition-of-seneca-babcock-eyesore-begins-community-homes-buffalo/71-f44d7871-e365-46e7-a953-8c6da63fa340"
  },
  {
    "title": "211 WNY",
    "text": "1168 Seneca Street Buffalo, NY 14210 www.senecababcock.com\n\n716-822-5094 x112\n\nFood Pantries\n\nFood pantry.\n\n\n\n##REENTRY##\n\n1st, 2nd, 4th, & 5th Wednesday of each month, 11am-3pm; 3rd Wednesday of each month, 5pm-9pm.\n\nResidents of zip codes 14206 and 14210.\n\nSelf-apply by walk-in. Must bring proof of address.\n\nFree.\n\nYes\n\nAug 29, 2024\n\nBrian Pilarski (Primary) Executive Director brian@senecababcock.com 716-822-5094",
    "url": "https://www.211wny.org/provider/10501/"
  },
  {
    "title": "Demolition of Seneca-Babcock eyesore begins",
    "text": "",
    "url": "https://www.youtube.com/watch?v=fF4fjzeOfEw"
  },
  {
    "title": "2005 Lovejoy, Seneca-Babcock racial tensions (The Buffalo News)",
    "text": "",
    "url": "https://www.documentcloud.org/documents/22049197-2005-lovejoy-seneca-babcock-racial-tensions-the-buffalo-news/"
  },
  {
    "title": "Seneca Street Community Development Corp. — Buffalo, NY",
    "text": "Having a safe place where you truly feel welcome and loved from the moment you walk in the door is a blessing; and that is exactly what Seneca Street CDC After-School Program has been to me since I was a little girl. This program ensured I wasn’t just another inner city kid statistic falling through the cracks. The SSCDC are always there to support and encourage students throughout the year with homework help, high school entrance exam preparations, emotional well-being, cooking classes, reading/math/science enrichment, creative learning, and so much more!\n\nMiss Destiny",
    "url": "https://www.senecastreetcdc.org/"
  },
  {
    "title": "Demolition begins on building that was blight on Seneca-Babcock neighborhood",
    "text": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada\n\nZip Code",
    "url": "https://buffalonews.com/news/local/demolition-begins-on-building-that-was-blight-on-seneca-babcock-neighborhood/article_0d328228-1729-11ed-8b6d-23ef5cd2ffff.html"
  },
  {
    "title": "Seneca-Babcock centers reopen after temporary closure due to utility bill dispute with city",
    "text": "UPDATE: In a letter on the Seneca-Babcock Community Association Facebook page on October 11, the association said: \"With the dedicated efforts of both South District Councilman Christopher P. Scanlon and Lovejoy District Council Member Bryan Bollman, we believe that both parties (City of Buffalo and SBCA) have successfully reached a tentative agreement to address the $91,000 owed to our agency and have resolved the shut-off notice from National Grid.\"\n\nIt resumed regular business operations on October 13.\n\nORIGINAL: The Seneca-Babcock Community Association president, Brian Pilarski, said a notice from National Grid was recently found on the front doors of the community center.\n\n\"I couldn't believe it, yeah, when I got that phone call said, 'Brian, there's a disconnect notice. I go, 'You gotta be kidding me,\" Pilarski said.\n\nWKBW\n\nThe notice shows that the City of Buffalo is about $1400 behind on utility bills for the center. Pilarski said the city agreed to pay them back for their old electric bills and new bills moving forward, but that hasn't happened.\n\n\"There was no communication. In regard to that I kept following up with the city saying, 'Hey we're, the $103,000.' And a couple weeks ago I received a check for $12,000. I go, 'Well, just no rhyme or reason.' I'm like, what does this cover all that it was not even a drop in the bucket,\" Pilarski said.\n\nWKBW\n\nNow he said the city owes them $91,000 for the old bills and because of this — the association has posted signs on its doors saying it's temporarily closing some programs including those for seniors.\n\nSeneca-Babcock Community Association\n\n\"It breaks my heart, but our senior activities coordinator here said one of the seniors broke down in tears like, 'Oh, I like coming to the center.' And, you know, we have to explain, 'No, look, it's not permanent.' This is why we're doing this world. We can't continue to operate. Being owed this money. You know?\" He said.\n\nPilarski said only essential services will remain open.\n\nWKBW\n\n\"It's really to send a message to City Hall. It's how much more can we cover? I don't want to say we're covering for them, but we're picking up their slack,\" he said.\n\nI reached out to Lovejoy District Council member Bryan Bollman who tells me he's also been asking and working with the city to find some kind of resolution.\n\nSeneca-Babcock Community Association\n\n\"I think the shut-off notice might have been the final straw that caused some frustration. So I'm just trying to bring everyone to the table, keep a level-headed approach here,\" Bollman said. \"I would just like an answer moving forward.\"\n\nI did reach out to the city about this. I was told the center's power won't be shut off and that the city is in the process of sending a $2400 bill to National Grid. I was told the original bill was sent to the wrong location.\n\nAs far as the $91,000 — I'm told the city is in the process \"of attempting to resolve that matter.\"\n\n\"It's a problem straight across the board for all we just happen to be the agency to speak up and say no more,\" Pilarski said.",
    "url": "https://www.wkbw.com/news/local-news/buffalo/picking-up-their-slack-seneca-babcock-centers-temporarily-close-after-utility-bill-dispute-with-city"
  }
]